Verification/Merlin/0/p

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101400.93090454886;


boundaryField
{
    outlet
    {
        type            waveTransmissive;
        field           p;
        gamma           1.148;
        fieldInf        101400.93090454886;
        psi             thermo:psi;
        lInf            1;
        value           uniform 101400.93090454886;
    }
    inlet
    {
        type            totalPressure;
        gamma           1.148;
        psi             thermo:psi;
        p0              uniform 9721611.6;
        value           uniform 9721611.6;
    }
    nozzle
    {
        type            zeroGradient;
    }
    outlet_r
    {
        type            waveTransmissive;
	    field           p;
        gamma           1.148;
        fieldInf        101400.93090454886;
	    psi             thermo:psi;
        lInf            1;
        value           uniform 101400.93090454886;
    }
    asym2
    {
        type            wedge;
        
    }
    asym1
    {
        type            wedge;
        
    }
}


// ************************************************************************* //