Verification/Merlin/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  	(0.0 0.0 0.0) // 0 
	(0.38273483006893727 0.0 0.0) // 1 
	(0.3877348300689373 0.0 0.0) // 2 
	(0.4595596001421339 0.0 0.0) // 3 
	(0.6058003514955663 0.0 0.0) // 4 
	(0.615459609758457 0.0 0.0) // 5 
	(1.8128709576850754 0.0 0.0) // 6 
	(1.8263939192531224 0.0 0.0) // 7 
	(14.565984798132806 0.0 0.0) // 8 
	(0.0 0.1982776216962553 0.00864874838664651) // 9 
	(0.38273483006893727 0.1982776216962553 0.00864874838664651) // 10 
	(0.3877348300689373 0.1969404248030329 0.008590420677377317) // 11 
	(0.4595596001421339 0.1540072117198049 0.006717700225061483) // 12 
	(0.6058003514955663 0.13479088321809538 0.00587949574840587) // 13 
	(0.615459609758457 0.13737414924608948 0.0059921762299486574) // 14 
	(1.8128709576850754 0.4576090961174408 0.019960628425447925) // 15 
	(1.8263939192531224 0.46122566855663255 0.020118381099607827) // 16 
	(1.8263939192531224 4.151031017009693 0.18106542989647045) // 17 
	(14.565984798132806 4.151031017009693 0.18106542989647045) // 18 
	(14.565984798132806 0.46122566855663255 0.020118381099607827) // 19 
	(0.0 0.19846651784466368 -0.008656987920915755) // 20 
	(0.38273483006893727 0.19846651784466368 -0.008656987920915755) // 21 
	(0.3877348300689373 0.19712804702380066 -0.008598604643703331) // 22 
	(0.4595596001421339 0.1541539321054546 -0.00672410007839753) // 23 
	(0.6058003514955663 0.13491929649268805 -0.005885097056773179) // 24 
	(0.615459609758457 0.13750502355989994 -0.005997884887338928) // 25 
	(1.8128709576850754 0.4580450535139121 -0.01997964461999939) // 26 
	(1.8263939192531224 0.4616650714080088 -0.02013754758279144) // 27 
	(1.8263939192531224 4.154985642672079 -0.18123792824512297) // 28 
	(14.565984798132806 4.154985642672079 -0.18123792824512297) // 29 
	(14.565984798132806 0.4616650714080088 -0.02013754758279144) // 30 
);

blocks
(
    	 hex (0 20 9 0 1 21 10 1 ) (20 1 77) simpleGrading (1 1 1)
	 hex (1 21 10 1 2 22 11 2 ) (20 1 2) simpleGrading (1 1 1)
	 hex (2 22 11 2 3 23 12 3 ) (20 1 15) simpleGrading (1 1 1)
	 hex (3 23 12 3 4 24 13 4 ) (20 1 30) simpleGrading (1 1 1)
	 hex (4 24 13 4 5 25 14 5 ) (20 1 2) simpleGrading (1 1 1)
	 hex (5 25 14 5 6 26 15 6 ) (20 1 240) simpleGrading (1 1 1)
	 hex (6 26 15 6 7 27 16 7 ) (20 1 3) simpleGrading (1 1 1)
    hex (7 27 16 7 8 30 19 8 ) (20 1 800) simpleGrading (1 1 1)//
    hex (27 28 17 16 30 29 18 19 ) (30 1 800) simpleGrading (1 1 1)//
);

edges
(
    	 arc 10 11 (0.3853230205199625 0.1979375282717372 0.008633913719822051)
    	 arc 12 13 (0.5559203545916183 0.1282365514241209 0.00559359981096356)
    	 arc 21 22 (0.3853230205199625 0.1981261004181859 -0.00864213912132431)
    	 arc 23 24 (0.5559203545916183 0.12835872048405797 -0.005598928750513013)
    //EDGE5_txt
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            	(0 20 9 0 )
            
        );
    }
    asym1
    {
        type wedge;
        faces
        (
            	 (0 9 10 1)
	 (1 10 11 2)
	 (2 11 12 3)
	 (3 12 13 4)
	 (4 13 14 5)
	 (5 14 15 6)
	 (6 15 16 7)
            (7 16 19 8)//
            (16 17 18 19)//
        );
    }



    outlet
    {
        type patch;
        faces
        (
           //(7 27 16 7 ) 
            (8 30 19 8)//
            (30 29 18 19)//
            //(17 28 29 18) //
        );
    }

    outlet_r
    {
        type patch;
        faces
        (
           //(7 27 16 7 ) 
           // (8 30 19 8)//
            //(30 29 18 19)//
            (17 28 29 18) //
        );
    }



    asym2
    {
        type wedge;
        faces
        (
            	(1 21 20 0)
	(2 22 21 1)
	(3 23 22 2)
	(4 24 23 3)
	(5 25 24 4)
	(6 26 25 5)
	(7 27 26 6)
            (8 30 27 7)//
            (30 29 28 27) //
        );
    }
    nozzle
    {
        type wall;
        faces
        (
            	(9 20 21 10)
	(10 21 22 11)
	(11 22 23 12)
	(12 23 24 13)
	(13 24 25 14)
	(14 25 26 15)
	(15 26 27 16)
	(16 27 28 17) 
	    
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //